---
kind: event
id: E:Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentChanged
source: html/f7acc5b4-a1b4-12ca-802b-0ee78942589e.htm
---
# Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentChanged Event

Subscribe to the DocumentChanged event to be notified when Revit document has changed.

## Syntax (C#)
```csharp
public event EventHandler<DocumentChangedEventArgs> DocumentChanged
```

## Remarks
This event is raised whenever a Revit transaction is either committed, undone or redone.
 This is a readonly event, designed to allow you to keep external data in synch with the state of the
 Revit database.
 To update the Revit database in response to changes in elements, use the IUpdater framework.